app/controllers/lances_controller.rb

	def create
    		@leilao = Leilao.find(params[:userId])
	    	@lance = @leilao.lances.create(params[:idUsuario])
---
SELECT * FROM "leilaos" WHERE ("leilaos"."id" = '--- :idUsuario
INSERT INTO "lances" ("idUsuario", "idLeilao", "idItem", "updated_at", "leilao_id", "created_at") VALUES(NULL, NULL, NULL, '2012-12-13 23:16:44', 8, '2012-12-13 23:16:44')