app/controllers/leilaos_controller.rb

  def index
    @leilaos = Leilao.all
---
SELECT * FROM "leilaos"

  def show
    @leilao = Leilao.find(params[:id])
---
SELECT * FROM "leilaos" WHERE ("leilaos"."id" = 1)

  def edit
    @leilao = Leilao.find(params[:id])
---
SELECT * FROM "leilaos" WHERE ("leilaos"."id" = 1)

  def create
    @leilao = Leilao.new(params[:leilao])

    respond_to do |format|
      if @leilao.save
---
INSERT INTO "leilaos" ("updated_at", "proprietario", "dataExpiracao", "created_at", "dataCriacao") VALUES('2012-11-20 04:44:21', 'Fulano de Tal', '2012-11-20 04:44:00', '2012-11-20 04:44:21', '2012-11-20 04:44:00')

  def update
    @leilao = Leilao.find(params[:id])

    respond_to do |format|
      if @leilao.update_attributes(params[:leilao])
---
SELECT * FROM "leilaos" WHERE ("leilaos"."id" = 3)
UPDATE "leilaos" SET "updated_at" = '2012-11-20 15:14:05', "proprietario" = 'Fulano de Tala' WHERE "id" = 3

  def destroy
    @leilao = Leilao.find(params[:id])
    @leilao.destroy
---
SELECT * FROM "leilaos" WHERE ("leilaos"."id" = 4)
DELETE FROM "leilaos" WHERE "id" = 4