app/controllers/pesquisar_controller.rb

  def index
    @leilaos = Leilao.all
---
SELECT * FROM "leilaos"